Repository: iowise/flutter_english_words
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Sign In
ru: Войти

source: Log Out
ru: Выйти

source: Sign-in with Google
ru: Войти с Google

source: Sign-in with Apple
ru: Войти с Apple

# definitionsTraining
source: Defs
ru: Опр.

# reviewNofMWords
source: Review {toReview} of {count, plural, =0{no Words} =1{1 Word} other{{count} Words}}
ru: Тренировать {toReview} из {count, plural, =0{0 Слов} =1{1 Слов} other{{count} Слов}}

# todayTrained
source: Today Trained: {todayTrained}
ru: Сегодня потренированно: {todayTrained}

source: Nothing is found
ru: Ничего не найдено

# labelsTitle
source: Labels
ru: Ярлыки

source: Sentence Training
ru: Тренировка предложений

source: Got an error.
ru: Произошла ошибка.

source: Please try again.
ru: Пожалуйста, повторите ещё раз.

# trainingAwesome
source: Awesome! 🚀
ru: Отлично! 🚀

# trainingTryAgain
source: Try again! 😸
ru: Ещё раз! 😸

# trainingUntilTheNextTime
source: Until the next time 😉
ru: Получится в следующий раз 😉

# trainingSynonyms
source: Synonyms: {words}
ru: Синонимы: {words}

# trainingAntonyms
source: Antonyms: {words}
ru: Антонимы: {words}

# trainingEnterNewWord
source: Please enter a new word
ru: Пожалуйста, введите новое слово

# trainingEnterSentence
source: Enter a Sentence
ru: Введите предложение

# trainingEnterSentenceEllipsis
source: Enter a sentence...
ru: Введите предложение...

# trainingNextTrainingOnDate
source: Next train on: {nextTrainDate}
ru: Следующая тренировку: {nextTrainDate}

# sortingSelectSortingAndFiltering
source: Select Sorting and Filtering
ru: Выберите Сортировку и Фильтр

# sortingSortWord
source: Sort by word
ru: Сортировать по слову

# sortingSortDate
source: Sort by date
ru: Сортировать по дате

# sortingShowNotTrained
source: Show not trained
ru: Показать не потренированные

# sortingShowAll
source: Show all
ru: Показать все

# editEnterWordHint
source: Enter a word...
ru: Введите слово...

# editEnterWordLabel
source: Word
ru: Слово

# editEnterTranslationHint
source: Enter a translation...
ru: Введите перевод...

# editEnterTranslationLabel
source: Translation
ru: Перевод

# editEnterDefinitionHint
source: Enter a definition...
ru: Введите определение...

# editEnterDefinitionLabel
source: Definition
ru: Определение

# editEnterContextHint
source: Enter a context...
ru: Введите контекст...

# editEnterContextLabel
source: Context
ru: Контекст

# editEnterSynonymsHint
source: Enter a synonyms...
ru: Введите синонимы...

# editEnterSynonymsLabel
source: Synonyms
ru: Синонимы

# editEnterAntonymsHint
source: Enter a antonyms...
ru: Введите антонимы...

# editEnterAntonymsLabel
source: Antonyms
ru: Антонимы

# editEnterLabels
source: Labels
ru: Ярлыки

# pagesTrain
source: Train a word
ru: Тренируй слово

# pagesEnterWord
source: Enter a word
ru: Ввод слова
